{
  "<pad>": 0,
  "<mask>": 1,
  "<bos>": 2,
  "<eos>": 3,
  "<unk>": 4,
  "A": 5,
  "C": 6,
  "G": 7,
  "T": 8,
  "CA": 9,
  "TG": 10,
  "AA": 11,
  "TT": 12,
  "CC": 13,
  "GG": 14,
  "AG": 15,
  "CT": 16,
  "CCA": 17,
  "CTG": 18,
  "AT": 19,
  "CAG": 20,
  "CG": 21,
  "TGG": 22,
  "CTT": 23,
  "AGG": 24,
  "AAG": 25,
  "ATG": 26,
  "ACA": 27,
  "TCA": 28,
  "CCT": 29,
  "ATT": 30,
  "CGG": 31,
  "TGT": 32,
  "AAT": 33,
  "CCG": 34,
  "CCAG": 35,
  "ACT": 36,
  "CTGG": 37,
  "AGT": 38,
  "CAT": 39,
  "CCTG": 40,
  "TTT": 41,
  "AAGG": 42,
  "CAGG": 43,
  "ACC": 44,
  "AAAA": 45,
  "ACAG": 46,
  "ACG": 47,
  "TTG": 48,
  "ACCA": 49,
  "ACTG": 50,
  "TGGG": 51,
  "ATGG": 52,
  "AGAA": 53,
  "ACTT": 54,
  "TGAA": 55,
  "CCTT": 56,
  "CCCA": 57,
  "TCT": 58,
  "TAG": 59,
  "AAAG": 60,
  "TGTT": 61,
  "GGG": 62,
  "AGGG": 63,
  "TAA": 64,
  "CTTG": 65,
  "AGCA": 66,
  "ATCA": 67,
  "CTCA": 68,
  "TGTG": 69,
  "AGAG": 70,
  "CCCT": 71,
  "TTTT": 72,
  "CGT": 73,
  "AAAT": 74,
  "AACA": 75,
  "CCAGG": 76,
  "CGGG": 77,
  "TTCA": 78,
  "TGCA": 79,
  "CTGT": 80,
  "CCGG": 81,
  "CTTT": 82,
  "CCTGG": 83,
  "TGAG": 84,
  "ATTT": 85,
  "CTCT": 86,
  "CCCAG": 87,
  "TCAT": 88,
  "ATGT": 89,
  "ACCT": 90,
  "TGGT": 91,
  "AATT": 92,
  "ACAT": 93,
  "ATCT": 94,
  "CTGGG": 95,
  "AATG": 96,
  "CCAT": 97,
  "CAGT": 98,
  "CCCG": 99,
  "CCTCA": 100,
  "ACGG": 101,
  "CACA": 102,
  "AAGT": 103,
  "CCCTG": 104,
  "TGCT": 105,
  "TGAT": 106,
  "ACCAG": 107,
  "CCACA": 108,
  "CCAAG": 109,
  "ATAT": 110,
  "TGAGG": 111,
  "ACTGG": 112,
  "TTCT": 113,
  "AGCT": 114,
  "CTTCA": 115,
  "CAGCA": 116,
  "TGATG": 117,
  "AGAT": 118,
  "CAGCT": 119,
  "TGAAG": 120,
  "AGGT": 121,
  "TGCTG": 122,
  "CAGAG": 123,
  "CAGGG": 124,
  "ACCG": 125,
  "CAAA": 126,
  "CTCTG": 127,
  "AAGGG": 128,
  "ATAG": 129,
  "CAAG": 130,
  "ACCTG": 131,
  "ATAA": 132,
  "AAGAA": 133,
  "TGTGG": 134,
  "CCCCA": 135,
  "TGTAG": 136,
  "ACAGG": 137,
  "TTTG": 138,
  "CTTCT": 139,
  "CTGAG": 140,
  "AC": 141,
  "CGAG": 142,
  "CTTGG": 143,
  "TGGGG": 144,
  "CTTTT": 145,
  "CTGCA": 146,
  "CGTG": 147,
  "TTAA": 148,
  "CCAGT": 149,
  "AGAAG": 150,
  "CTGCT": 151,
  "CGCA": 152,
  "TGGAA": 153,
  "CCTCT": 154,
  "CCCGG": 155,
  "TGGAG": 156,
  "AAGCA": 157,
  "ATTG": 158,
  "TCAG": 159,
  "CCCAGG": 160,
  "TCAGG": 161,
  "ATCCA": 162,
  "ACAAA": 163,
  "CCCTT": 164,
  "AAGAG": 165,
  "TGCAG": 166,
  "CTCCA": 167,
  "ATGGG": 168,
  "AACT": 169,
  "ACAAG": 170,
  "ACATT": 171,
  "CCTGGG": 172,
  "TCACA": 173,
  "CCGT": 174,
  "AGTT": 175,
  "AAGAT": 176,
  "CAGCAG": 177,
  "AGAGG": 178,
  "TTTCA": 179,
  "CCACCA": 180,
  "AAATT": 181,
  "AAAGG": 182,
  "CTGGT": 183,
  "TGGCA": 184,
  "AGCTG": 185,
  "TAT": 186,
  "TGCG": 187,
  "CCCCT": 188,
  "CCTTT": 189,
  "ATTTT": 190,
  "AAATG": 191,
  "CGGGG": 192,
  "CCCTGG": 193,
  "AGCTT": 194,
  "CCTGT": 195,
  "CCGGG": 196,
  "AGATG": 197,
  "ACTTT": 198,
  "CCACT": 199,
  "CAGTG": 200,
  "CCCAT": 201,
  "ACACA": 202,
  "TTCAG": 203,
  "TGGAGG": 204,
  "ACTGT": 205,
  "CCTTG": 206,
  "AAGAAG": 207,
  "CTGTG": 208,
  "TGGCT": 209,
  "CGCG": 210,
  "AAAAG": 211,
  "TAGG": 212,
  "AAAAT": 213,
  "CCATG": 214,
  "AGCAG": 215,
  "TGGTT": 216,
  "CTCTT": 217,
  "CTCG": 218,
  "ATATT": 219,
  "CTTTG": 220,
  "CCAGGG": 221,
  "CGGT": 222,
  "CCCCAG": 223,
  "CTGAA": 224,
  "CTGTT": 225,
  "ATATG": 226,
  "CTGAGG": 227,
  "CCCCG": 228,
  "CACG": 229,
  "AAAAAG": 230,
  "AACAG": 231,
  "AGGGG": 232,
  "AATTG": 233,
  "ATCG": 234,
  "AAAACA": 235,
  "CTCAG": 236,
  "CCACG": 237,
  "CCATT": 238,
  "TGGTG": 239,
  "TCG": 240,
  "CTACA": 241,
  "ACTCA": 242,
  "AGTG": 243,
  "CCC": 244,
  "ACGT": 245,
  "CCAAA": 246,
  "CCTCCA": 247,
  "ATTCA": 248,
  "CAGTT": 249,
  "AAGTG": 250,
  "ATGAA": 251,
  "ACCTT": 252,
  "TCTT": 253,
  "TGTCT": 254,
  "AGGTG": 255,
  "AATCA": 256,
  "AAACT": 257,
  "ACCTGG": 258,
  "ACCCA": 259,
  "ATCAG": 260,
  "TACA": 261,
  "ATGTCA": 262,
  "CCACTG": 263,
  "CCTCG": 264,
  "CCAGCA": 265,
  "CTTGT": 266,
  "CTTCTT": 267,
  "ATCTG": 268,
  "AGTAG": 269,
  "TGGTGG": 270,
  "AGACA": 271,
  "ACTTCA": 272,
  "ATGGCA": 273,
  "CATCT": 274,
  "CAGGT": 275,
  "CCTTCA": 276,
  "ATCTT": 277,
  "ATTTG": 278,
  "ATGTT": 279,
  "TCAAG": 280,
  "CAGAA": 281,
  "CTAG": 282,
  "AAAAAAAA": 283,
  "CCAAGG": 284,
  "CTGGGG": 285,
  "ATGCA": 286,
  "AATAG": 287,
  "ATTGT": 288,
  "CCCCTG": 289,
  "AACTT": 290,
  "CAGAGG": 291,
  "ACATG": 292,
  "ACAAAG": 293,
  "TGGCG": 294,
  "ACCAGG": 295,
  "ATGAG": 296,
  "CCGTG": 297,
  "AACTG": 298,
  "AACG": 299,
  "CTCCT": 300,
  "TGGAAG": 301,
  "CAGCCA": 302,
  "ACTTG": 303,
  "CTTTTG": 304,
  "CCGCG": 305,
  "TGTTG": 306,
  "ATCAT": 307,
  "TGGCCA": 308,
  "ACATCA": 309,
  "CTGAAG": 310,
  "AGGAG": 311,
  "TGTTTT": 312,
  "ATTTCA": 313,
  "TGTTCA": 314,
  "CTGCCA": 315,
  "TCCA": 316,
  "ATGAGG": 317,
  "ACAGCA": 318,
  "ATGATG": 319,
  "AGGCA": 320,
  "CCACAG": 321,
  "CGGCG": 322,
  "CTTCAT": 323,
  "TGAACA": 324,
  "CTTTCT": 325,
  "TGTCG": 326,
  "CTGCAG": 327,
  "TTTCT": 328,
  "CCCACA": 329,
  "ACCGG": 330,
  "ACATTG": 331,
  "TGCCA": 332,
  "CCGAG": 333,
  "ATGTTG": 334,
  "ACAGT": 335,
  "CATAG": 336,
  "ATAAT": 337,
  "ACAGAG": 338,
  "ACCCT": 339,
  "AGGAA": 340,
  "TATT": 341,
  "CTCGG": 342,
  "TTGG": 343,
  "CTTCG": 344,
  "ACACG": 345,
  "TAAG": 346,
  "ATTGG": 347,
  "ACGGG": 348,
  "ATTTTG": 349,
  "ACTGGG": 350,
  "CGGCCA": 351,
  "CCCGGG": 352,
  "CCCCTT": 353,
  "CTGCG": 354,
  "TCATT": 355,
  "TGCAAG": 356,
  "CCTCAG": 357,
  "ATACA": 358,
  "AGCG": 359,
  "TAGT": 360,
  "ATTCAG": 361,
  "ATGAAG": 362,
  "CCTGCA": 363,
  "TCTG": 364,
  "CCTCCT": 365,
  "CAGTGG": 366,
  "ACTCT": 367,
  "AAGGAG": 368,
  "TGTCCA": 369,
  "TGTCA": 370,
  "TGTTT": 371,
  "ACTGCA": 372,
  "TAACA": 373,
  "CTGTGG": 374,
  "AATAA": 375,
  "TTCTT": 376,
  "CGTT": 377,
  "ATTAA": 378,
  "ACAAT": 379,
  "CCATCA": 380,
  "CTGGAG": 381,
  "AAGCT": 382,
  "AGGAGG": 383,
  "AAGTT": 384,
  "CTGTTG": 385,
  "TTTAT": 386,
  "TATG": 387,
  "CAGCTG": 388,
  "ATTCT": 389,
  "TGACA": 390,
  "ATTAT": 391,
  "CCCCGG": 392,
  "TTAG": 393,
  "CCTGTG": 394,
  "CAGCG": 395,
  "AATTT": 396,
  "TTCCA": 397,
  "CCCTCA": 398,
  "TGTAA": 399,
  "CTGGCA": 400,
  "CATCG": 401,
  "CCCCCA": 402,
  "CGGCGG": 403,
  "AAGGGG": 404,
  "TGGATG": 405,
  "TGTCTG": 406,
  "TCATAG": 407,
  "CCTCCAG": 408,
  "TGACT": 409,
  "ATGGT": 410,
  "AAGAGG": 411,
  "TCAACTGG": 412,
  "TTAT": 413,
  "AAGGCA": 414,
  "CGAGG": 415,
  "AATAT": 416,
  "CCTTTG": 417,
  "CCTCTG": 418,
  "TTTCCA": 419,
  "CAGAAG": 420,
  "ACAAGG": 421,
  "AATCT": 422,
  "TGAACT": 423,
  "CAGCAT": 424,
  "ATAGT": 425,
  "TGGACA": 426,
  "ACCTCA": 427,
  "TGCTT": 428,
  "ATTCCA": 429,
  "ACCACA": 430,
  "TTTGT": 431,
  "CTTGCA": 432,
  "ACTCCA": 433,
  "CAGTCA": 434,
  "TGGTTG": 435,
  "TGAAAT": 436,
  "CCTCCTG": 437,
  "ATGTG": 438,
  "TGAAGTT": 439,
  "TGA": 440,
  "TGGTCA": 441,
  "TCTCA": 442,
  "CGGCA": 443,
  "CCGCA": 444,
  "ATGGCG": 445,
  "TTCAT": 446,
  "AGTACA": 447,
  "TCAAAG": 448,
  "ACAACA": 449,
  "TAGCA": 450,
  "AGAAAG": 451,
  "AACAT": 452,
  "CCCC": 453,
  "AGGCT": 454,
  "CCTTCT": 455,
  "CCTCTT": 456,
  "CCGGGG": 457,
  "ACACTG": 458,
  "CGGAG": 459,
  "ATGCTT": 460,
  "ACGTTG": 461,
  "AATACT": 462,
  "AGTTT": 463,
  "TGATT": 464,
  "AAGGT": 465,
  "CCAGAG": 466,
  "ACTTCT": 467,
  "ATTCTG": 468,
  "CTTCTG": 469,
  "ACCCCA": 470,
  "CTTCCA": 471,
  "ATGCT": 472,
  "CCCAGCA": 473,
  "AAGTTG": 474,
  "TGCACA": 475,
  "CGGTG": 476,
  "AATGG": 477,
  "ATCCCA": 478,
  "TGAAGG": 479,
  "AAAGCA": 480,
  "AGGAT": 481,
  "AAAGT": 482,
  "TGTGT": 483,
  "CTGCTG": 484,
  "TCAGGG": 485,
  "ACCCG": 486,
  "TGGGGG": 487,
  "CCCCCT": 488,
  "CCTTGG": 489,
  "CCAAAG": 490,
  "CTTCAG": 491,
  "AGAGT": 492,
  "ACATGG": 493,
  "TGAGT": 494,
  "TTCCT": 495,
  "ACTTGG": 496,
  "ATCAGG": 497,
  "ATGTGG": 498,
  "TTTTCA": 499,
  "CGAA": 500,
  "CGGAGG": 501,
  "CCATAG": 502,
  "AACCA": 503,
  "CTGATG": 504,
  "CTCACA": 505,
  "TTCTGG": 506,
  "ACAGGG": 507,
  "CCCGT": 508
}